app/controllers/songs_controller.rb

  def index
    if params[:artist_id]
     @artist = Artist.find(params[:artist_id])
     if @artist.nil?
       redirect_to artists_path, alert: "Artist not found"
     else
       @songs = @artist.songs
     end
   else
     @songs = Song.all
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = ?  [["artist_id", 5]]

  def show
    @song = Song.find(params[:id])


    if params[:artist_id]
     @artist = Artist.find(params[:artist_id])
     if @artist.song.nil?
       redirect_to artists_path, alert: "Artist not found"
     else
       @songs = @artist.songs
     end
   else
     @songs = Song.all
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = ? LIMIT 1  [["id", 7]]
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "songs".* FROM "songs" WHERE "songs"."artist_id" = ? AND "songs"."id" = ? LIMIT 1  [["artist_id", 5], ["id", 12345]]